package sec06;

public class Test0323 {

	public static void main(String[] args) {
		/*
		1. 아래와 같은 조건의 원이 있다. 이 원의 면적과 둘레를 출력하는 java 프로그램을 작성하라.
		  반지름 7.5 

		2. 세 개의 숫자를 입력받아 숫자의 평균을 계산하고 출력하는 java 프로그램을 작성하라.
		   Scanner 이용 입력 받을 것

		3. 너비 5.5 높이 8.5 직사각형의 면적과 둘레를 출력하는 java 프로그램을 작성하라.


		4. 두 변수의 값을 서로 교환하는 java 프로그램을 작성하라.


		5. 두 개의 이진수를 더하는 java 프로그램을 작성하라.
		   Scanner 이용 입력받을 것

		6. 두 개의 이진수를 곱하는 java 프로그램을 작성하라.
		   Scanner 이용 입력받을 것


		7. 10진수를 2진수로 변환하는 java 프로그램을 작성하라.
		   Scanner 이용 입력 받을 것


		8. 10진수를 8진수로 변환하는 java 프로그램을 작성하라.
		   Scanner 이용 입력 받을 것


		9. 2진수 100을 10진수로 변환하는 java 프로그램을 작성하라.


		10. 2진수 1101을 16진수로 변환하는 java 프로그램을 작성하라.


		11. 2진수 111을 8진수로 변환하는 java 프로그램을 작성하라.


		12. 컴퓨터에 java가 설치되어 있는지 확인하는 java프로그램을 작성하고 아래와 같은 내용을 출력하라.
		     자바버전, 자바 런타임 버전, 자바 홈, 자바 공급업체, 자바 벤더 URL, 자바 클래스 경로
		    hint : 웹에서 System.getProperty를 검색해 볼 것


		13, 두 개의 정수를 입력 받아 두 수가 같은지 아니면 어느쪽이 큰지 비교하는 java프로그램을 작성하라.
		     출력 에) 23 == 23,    23 < 30 


		14. 문자열 The quick brown fox를 xof nworb kciuq ehT로 반전시키는 java 프로그램을 작성하라.


		15. 입력 문자열의 문자, 공백, 숫자 및 기타 문자를 계산하는 java 프로그램을 작성하라.
		    hint) 사용 메소드 - toCharArray(),  isLetter(), isDigit(), isPsaceChar()   

		16. 1, 2, 3, 4 를 이용하여 무작위로 3자리 숫자를 생성하는 java 프로그램을 작성하라.
*/
		
		
		
	}

}
